Первый поток:
    Включить прожектор
    Повторяй пока "Истина":
        Повторяй 120 раз:
            Опроси датчик ЭМА_1
            Сохрани результа
            Опроси датчик ЭМА_2
            Сохрани результат
            Опроси Датчик ЭМА_3
            Сохрани результат 
            Повернись по сечению трубы против часовой стрелки 
        Проверка гироскопа
        Проверка трех датчиков расстояния
        Если на всех расстояния менее 20 см:
            все колеса СТОП
        Если расстояние на датчикках одинаково:
            все колеса едут вперед 1 шаг
        Если расстояние на датчиках различается:
            колеса с меньшим расстоянием замедляются
    Едь назад до конца
    Завершить запись видео

Второй поток:
    Запись видео
